a = 0 #Сюди користувач вводить перше число
b = 0 #Сюди користувач вводить друге число

    #print("Вкажіть значення a: ")
#Змінюємо тип з int на текст
a=input("Вкажіть значення а: ") # Це є текст
b=input("Вкажіть значення а: ") # Це є текст - це звичайні символи
#int() - це функція, яка перетворює вхідне значення у число
#str() - це функція, яка із вхідного значення робить рядок
c = int(a) + int(b)
    #print("a + b = " + str(c))
print(a + " + " + b + " = " + str(c))
c = int(a) - int(b) # Віднімаємо значення двох змінних
print(a + " - " + b + " = " + str(c))

c = int(a) * int(b) # Множимо значення двох змінних
print(a + " * " + b + " = ", c) # Через , виводиться значення змінної