print("---Робота із списками в Python---") # виводимо заголовок

myList = [12, 18, 33, 22] # створюємо список
print("Початковий список:", myList) # виводимо список


mixedList = [12, "Hello", 45.6, True] # створюємо список з різними типами данних
print("Список з різними типами даних:", mixedList) # виводимо список з різними типами данних


print("Перший елемент списку myList:", myList[0]) # виводимо перший елемент списку з індексом 0

myList[0] = "Сало" # змінюємо перший елемент списку на рядок "Сало"

print("Змінений список myList:", myList) # виводимо змінений список

myList.append(29) # Додаємо новий елемент 29 в кінець списку
print("Список myList після додавання нового елемента 29:", myList) # виводимо змінений список

cats = ["Мурка", "Барсик", "Васька"] # робимо список
print("Список котів:", cats) # виводимо список

myList.extend(cats) # додаємо усі елементи списку cats до списку myList
print("myList після додавання списку котів:", myList) # виводимо змінений список myList

del myList[0] # видаляємо перший елемент списку
print("myList після видалення першого елемента:", myList) # виводимо змінений список

myList.append(['ss', 'ee']) # додаємо новий список до myList
print("myList після додавання нового елемента-списку:", myList) # виводимо змінений список

print("Довжина myList:", len(myList)) # виводимо довжину списку ( кількість елементів списку )

myList.extend([100, 200, 300]) # додаємо 3 числа до списку
print("myList після додавання ще трьох елементів:", myList) # виводимо змінений список
