print("Оператор break та continue")
#break - перериває роботу циклу
#continue - повертає цикл до перевірки умови, тобто робить повтор
#школа - підрахувати скільки учнів є в школі
#вік учнів
ages = (12, 18, 23, 61 , 10, 112)
count = 0
for age in ages:
    if age > 100:
        print("Программа стикнулася із критичною помилкою! Робота не можлива!")
        break
    if age < 18:
        count += 1
    else:
        continue # якщо це не є дитина школи - print - буде виводитися, якщо if працює
    print(f"Дитині зараз {age} до повноліття лишилося {18-age} років")

print("Кількість дітей школи: ", count)

#Змінити це приклад таким чином, щоб користува вік учнів вводив з клавіатури.
#Тобто кількість учнів невідо до початку роботи програми.
#Бажано використати цикл while.