print("\f-----Використання циклу for-----\f")

ints = [23, 18 , 17, 12] # набір цілих чисел
# f - форматований рядок - це рядок у який можна підставляти змінну через {}
for item in ints:
    print(f"item = {item}\t", end=" ") # виводимо всі числа з набору ints
    # print("item = ", item)
# як перевірити парні числа - %
print("Пошук парних чисел у послідовності: ")
for item in ints:
    if(item % 2 == 0):
        print(item, end="\t") # виводимо парні числа в однмоу рядку через табуляцію

'''
myInt = int(input())
if ( myInt % 2 == 0):
    print(f"{myInt} - парне число")
else:
    print(f"{myInt} - непарне число")
'''
