print("idk")
# генерація послідовності чисел
items = range(5) # чтыорили змынну items, яка зберігає последовність
# items зберігає числа від 0 до 4
lengthItems = len(items) # lengthItems - зберігає довжину послідовності
print("lengthItems = ", lengthItems) # виводимо довжину послідовності


# Цикл for для інтеграціцї по послідовності
# Синтаксис for:
# for нова_змінна in назва_послідовності:
#   блок_коду_для_виконання
# Цикл працює інтеграціями - тобто тіло цикло ( це код у середені циклу )
# Код, який працює всередині циклу буде мати відступ ( 4 пробіла або табуляція )
for grinka in items: # перебирає елементи послідовності, що знаходяться в items
    print("item = ", grinka) # виводимо поточне значення змінної grinka

print("Вкажіть діапозон чисел: ")
begin = int(input()) # вводимо числа зк лавіатури
end = int(input()) # вводимо числа зк лавіатури

print(f"begin = {begin}, end = {end}")

# генеруємо вказану послідовність чисел
myRange = range(begin, end) # створили послідовність чисел від begin до end
print("Ваша послідовність чисел: ")
for myItem in myRange: #v цикл for перебирає послідовність myRange
    print(myItem, end='\t') # виводимо всі числа в одному рядку через пробіл
