# print(f"\nПривіт козаки і козачки\n")
# Відкриваємо файл my.txt
file_name = "my.txt"
try:   # У блок try поміщається блок коду, який може відвалитися ( статися помилка )
    my = open(file_name, 'r', encoding="utf8")
    file_content = my.read() # читаємо усі данні із файлу
    print(f"\n--- Вміст файлу {file_name} ---\n")
    print(file_content)
    my.close # Стараємося завжди закривати
except: # Якщо щось трапляеться у блоці try трапляєтсья помилка код переходить у данний блок
    print("\n--Помилка роботи із файлом--\n")

print("\nЗавершення роботи програми\n") # Виводимо інформацію про завершення роботи програми