# --- Запис даних у файл ---
# print("idk")
# Якщо відкриваємо файл для запису - флажок w - то файл
# автоматично створюється, якщо його немає.
file_output = open("user.txt", 'w', encoding="utf-8") # файл відкритий для запуску
# змінна file_output зберігає посилання на файл user.txt
# file_output - підключення до файлу і зберігає вказівник
#  на позицію у файлі - на початку позиції у файлі 0 - початок файлу
file_output.write(f"Зима холодна\n") # записуємо рядок
file_output.write(f"Наче вчора\n") # записуємо рядок
file_output.write(f"Я бачив\n") # записуємо рядок
file_output.write(f"Щасливих людей\n") # записуємо рядок
file_output.write(f"Що раділи життю\n") # записуємо рядок

file_output.close() # відключаюся від файлу
