    #print("Перевірка")
# Запис camel case - пишемо одне слово, але щоб
# краще читати робимо великі букви для нових слів
firstName = "Іван"
firstname = "Іван" # це 2 різних змінні вони відрізняються регістром
print("Привіт ", firstName)

a = 12 # Цілі числа - а - зьерігає у собі цілі числа
print("a =", a)

b = 34.45 # Дробовк число - потрібно писати через точку
print("b =", b)

isMan = True # Зберігає булівське значення True ( істинна ) або False ( хиба )
isMan = False # Зберігає хибне значення
print("isMan =", isMan)

text = "Класна погода"
print("text =", text)

#Можна використовувати спеціальні символи \t, \n
# \t - відступ табуляції
# \n - перехід на новий рядок
text = "Можна іти гуляти\nВийшло сонечко на вулицю\n\tБіжу по калюжах"
print('text =', text)


email = "andrey@gmail.com"
name = "Andrey"
string = f"name = {name}\temail = {email}" #перед рядком f - означає, що буде підстановка
print(string)

#Динамічна типізація - це коли тип данних може змнюватися у процесі виконання
age = 18
print("type(age) =", type(age))
age = "Сало"
print("age =", age)
print("type(age) =", type(age)) # type - перевіряє який тип зберігається в age

print("Данний текст виводиться у рядок і після нього новий рядок", end=" ")
print("Новий рядок")