    #print("Привіт! Сьогодні класна погода :D")
#Будемо виводити результат арифетичної операції
    #print(3+4) # Регістор символів має значення

#   ↓↓↓ Не правильно ↓↓↓
#    print("Не вірний код")
#PRINT("Привіт")
#Print("Привіт - це не вірно")

# -- однорядковий календар - коментує 1 рядок
'''
Це є багаторядковий коментар
Це є багаторядковий коментар
'''

    #print("Мене звати: " , "Вова" , "IT STEP")

print("Як Вас звати?: ")
#Змінна має певну назву і може зберігати значення
name = input() #змінна - це величина, яка може зберігати інформацію
print("Приємо познайомитися: ", name)
