print("----Арифметичні операції----")
# +, -, *, /, //, **, %, +=, -=, /=, **=, %=
a = input("Вкажіть значення а = ") # input - повертає рядок
b = input("Вкажіть значення b = ") # input - повертає рядок

print(f"a = {a}\tb= {b}") # Щоб перевірики, що у нас у змінних а та b
#int() функція яка перетворює значення рядка у число
#float() - перетворює у дробове число
intA = int(a) #перетворила рядок а  до цілого числа
intB = int(b)
c = intA + intB
print(f"a + b = {c}") # f - рядок підстановки - буде підставлятися змінна {}

c = intA - intB
print(f"a - b = {c}")