print("Привіт! Сьогодні класний туман :D")
# == Оператор рівності
# != Оператор нерівності
# > Оператор більше
# < Оператор менше
# >= Оператор більше або дорівнює
# <= Оператор менше або дорівнює

c = 2 == 4 # c - булеве значення ( True або False )
print("2==4", c) # False

a = 8
b = 5
c = a = b # = - оператор присвоєння - надання значення змінній - 
print("c = a = b", c) # 5

a = 14 # Присвоїв значення 14 змінній а
c = a != b # Оператор нерівності !=
print("a != b =", c) # True

# a = 14 b = 5
c = a>=b # Оператор більше або дорівнює >=
print("a >= b =", c)