# Оператор умови ( тернарний оператор ) у Python

    #if Умова:      -- Пишемо будь-яку умову, після умови ставимо :
        # Виконується, якщо умова істнна
    #   виконує_дію_1()

age = input("Введіть ваш вік: ") # Ми з клавіатури вводимо текстове значення
# Перетворює текстове значення у ціле число - бо ми маємо вік у вигляді числа
age = int(age) # Перетворюємо тектове значення у ціле
if age >= 18:
    print("Ви вже повнолітні!")
    print("Ви можете здавати на водійські права.")
else:
    print("Ви ще надто молоді.")
    print("Ви не можете здати на водійські права.")
# Цей код виконується завжди, тобто на ного не впливає умова if або else
print("Дякуємо за увагу!")