# Використання конструкції elif для перевірки кількох умов
# lower() - приводить усі введені символи користувача у нижній регістр
# qwerty - нижній регістр
# QWERTY - верхній регістр
lang = input("Вкажіть вашу улюблену мову програмування: ").lower()
print("Ваша мова програмування: " + lang)
if lang == "python":
    print("Ви обрали Python!")
    print("Python - це чудовий вибір для початківтів.")
    print("Для складних та маштабних проектів можна щось краще.")
elif lang == "java":
    print("Ви обрали Java!")
    print("Java використовується для розробки мобільних додатків \nта корпоративних систем.")
elif lang == "c++":
    print("Ви обрали C++!")
    print("C++ підходить для розробки ігор та системного програмування")
elif lang == "linux":
    print("Ви обрали Linux!")
    print("Це найкраще ядро!")
else:
    print("Ви вказали незрозуміли нам мову - " + lang + '.')