print("---Перевірка ввмінь додавати та віднімати числа---")
result = input("Скільки буде 2+2 ? ") # вводимо символи з клавіатури ( тобто рядок )
a = 2 # створили змінну а і присвоїли їй значення 2
b = 2
c = a + b
print("type of result: ", type(result))
print("type of c", type(c))
if result == str(c): # перетворюємо змінну с у рядок
    print("Правильно!")
else:
        # print("Неправильно! 2 + 2 = ", str(c))
        print("Неправильно! 2 + 2 = "+ str(c)) # конкатенація рядківі ( складення рядків )
        
# c = "Ковбаса" # перезаписуємо змінну с рядком "Ковбаса", тобто зміни типу данних з int на str
