# Користувач вводить номер тижня 1 - понеділок, 2 вівторок і т.д.
# Программа виводить нахву дня тижня відповідно до введеного номемра.
# Користувач вказує номер тижня
day = input("Введіть номер дня тижня (1-7): ")
# Перетворюю str на int
day_num = int(day) # створив нову змінну day_num і перетворив str в int і в неї записав
if day_num == 1:
    print("Понеділок")
elif day_num == 2:
    print("Вівторок")
elif day_num == 3:
    print("Середа")
elif day_num == 4:
    print("Четверг")
elif day_num == 5:
    print("П'ятниця")
elif day_num == 6:
    print("Субота")
elif day_num == 7:
    print("Неділя")
else:
    print("некоректний номер тижня")