# while - цикл з передумовою
# для роботи циклу умова має бути вірною ( True )
i = 0 # початкове значення лічильника
count = int(input("Скажіть кількість кроків циклу: "))
# створюємо цикл, який буде працювати доки і < 5
while i < count: #умова визначення циклу
    print("Початкове значення i: ", i) # виведення поточного значення лічильника
    i += 1 # i=i+1 змінює ітерації циклу - збільшення лічильника на 1
print("Цикл завершено. Остаточне значення i: ", i) # виведення остаточного значення циклу
