# print("Привіт усім!")

# Функція - це уменований блок коду, який виконує певне звадання
# Функції допомагають уникати проблеми дублювання коду
# роблячи код більш організованим і легким для читання
# Ми можемо оголосити функцію і описати її поведінку
# Потім викликати її довільну кількість разів у будь-якому місці нашого коду

# прототип оголошення функції
# def назва_функції()
#     блок_коду_функції

# def - ключове слово для оголошення функції
# назва_функції - ім'я, яке ми даємо нашій функції
# не може починатися з цифри, не оже містити пробілів,
# не може бути зарезервована словом
# Зарезервовані слова: if, else, for, while, def, return
# print - теж зарезервоване слово - це назва вбудованої функції
# 
# Функція особлива тим, що вона у кінці слова має ()
# У кінці оголошенох функції стоїть двокрапка:
# Тіло функції ( блок коду функції ) - що функція буде виконувати
# має бути відступлено на 4 пробіли або один табуляр

# Перед словом функції визначаємо, що вона має робити
# Давайте напишемо фукнцію, яка буде виводити привітання з днем закоханих


# запис функції CamelCase - кожне нове слово с великої літери
def greetVelentiens():
    print("--Вітаю з Днем Закоханих--!")
    print("++Шукай половинку серця++!")

# Ми створили функцію, яка буде виводити 2 рядки тексту
# Тобто виводить привітання з днем закоханих

# Як викликати функцію?
# greetVelentiens() # викликаю код функції в данному місці функція виконає свій код

# Тепер виклечимо функцію декілька разів
count = input("Скільки разів вас привітати з Днем Закоханих?: ")
int_count = int(count) # перетворює рядок в ціле число
i=0 # лічильник циклу - кожна ітерація збільшує лічильник на 1
while i < int_count:
    greetVelentiens() # виклик функції
    i += 1 # збільшуємо лічильник на 1