def myPrint(): # Дана функція не приймає параметрів
    print("Це моя функція") 

myPrint()

# Особливості викликання функції:
# 1. Функції можуть приймати параметри або будти без параметрів
# В залежності від задачі, яка ставиться на функцію, може
# не приймати парматрів взагалі, або приймати 1 параметр,
# 2 - параметри або певний масив(набір) параметрів
#
# Для побудови функції з параметри, потрібно вказати назву параметрів
# Давайте зробимо фуцнкцію, яка приймає 1 параметр - пишему змінну
# і виводить значення параметра на екран

# змінна text - це формальний параметр, функції, який може використовуватись
# у середині функції
# формальний, бо коли буде визиватися функція,
# то він буде фактично - якимось певним текстом
def my_hello_friend(text): # функція називається my_hello_friend
    print("---"+text+"---") # + - конкатонація рядків - об'днання

# в данному випадку text = "Салют команда :D"
my_hello_friend("Салют команда :D") # слово "Салют команда :D"

name = input("Як Вас звати?: ") # створили змінну name - записали у неї текст з клавіатури
my_hello_friend(name) # функція приймає фактичний параметр name - що вводимо з консолі

