# Будемо робити функцію, яка буде виводити
# повідомлення певня кількість разів на екран
# функція приймає параметр 1 - це кількість

idk = int(input("Введіть число: "))

# count_viev = кількість - число - ітерації роботи циклу
def my_print_count(count_viev): # my_print_count - назва функції 
    if count_viev < 0:
        print("Не допустиме значення кількості", count_viev)
        return # вихід із фунекції
    i = 0 # змінна, яка відповідає за кількість ітерацій циклу
    while(i!=count_viev): # працює доки не дійде до count_viev 5
        print("Обідати")
        i = i + 1 # збільшуємо лічильник цифру

my_print_count(idk)  