# Функція приймає два параметри
# 1 - параметр - кількість разів
# 2 - параметр - текст, який виводимо
# Коли виводимо на екран формат виводу має бути такий 
# 1 - ТЕКСТ 
# 2 - ТЕКСТ
# n - TEКСТ
# Якщо 1 параметр менший 0, то нічого не робимо

def my_viev_salo(count_try, my_text):
    # count_try = 3 # кількість кроків
    # my_text = "Сало"

    i=0 # лічильник циклів
    while i < count_try:
        print(f"{i+1} - {my_text}")
        i+=1

count = input("Вкажіть кількість: ")
text = input("Вкажіть повідомлення: ")
# my_viev_salo(2, "Слава Україні!")
my_viev_salo(int(count), text)