#Діапазон значень
start = int(input("Початок дліапазону: "))
end = int(input("Kінець дліапазону: "))
print(f"Числа від {start} до {end}")
parni = [] #Буде зберігати парні числа масива
i = 0 #лічильник циклу
while i <= end:
    print(i, end='')
    if i % 2 == 0:
        parni.append(i) #додаємо парне число до списку парних чисел
    i += 1 #крок ітерації діапазону
print() # для переходу на новий рядок після виведення діапазону

print("Парні числа в діапазоні: ")
for item in parni:
    print(item, end='\t')